c({"type": "function", "name": "Y.EventHandle.publish", "params": [{"name": "type", "description": "<p>{String} the type, or name of the event</p>"}, {"name": "opts", "description": "<p>{object} optional config params.  Valid properties are:</p>\n\n<p><ul>\n   <li>\n  'broadcast': whether or not the YUI instance and YUI global are notified when the event is fired (false)\n   </li>\n   <li>\n  'bubbles': whether or not this event bubbles (true)\n             Events can only bubble if emitFacade is true.\n   </li>\n   <li>\n  'context': the default execution context for the listeners (this)\n   </li>\n   <li>\n  'defaultFn': the default function to execute when this event fires if preventDefault was not called\n   </li>\n   <li>\n  'emitFacade': whether or not this event emits a facade (false)\n   </li>\n   <li>\n  'prefix': the prefix for this targets events, e.g., 'menu' in 'menu:click'\n   </li>\n   <li>\n  'fireOnce': if an event is configured to fire once, new subscribers after\n  the fire will be notified immediately.\n   </li>\n   <li>\n  'async': fireOnce event listeners will fire synchronously if the event has already\n   fired unless async is true.\n   </li>\n   <li>\n  'preventable': whether or not preventDefault() has an effect (true)\n   </li>\n   <li>\n  'preventedFn': a function that is executed when preventDefault is called\n   </li>\n   <li>\n  'queuable': whether or not this event can be queued during bubbling (false)\n   </li>\n   <li>\n  'silent': if silent is true, debug messages are not provided for this event.\n   </li>\n   <li>\n  'stoppedFn': a function that is executed when stopPropagation is called\n   </li></p>\n\n<p><li>\n  'monitored': specifies whether or not this event should send notifications about\n  when the event has been attached, detached, or published.\n   </li>\n   <li>\n  'type': the event type (valid option if not provided as the first parameter to publish)\n   </li>\n </ul></p>"}], "parent": "Y.EventHandle", "body": "", "description": "<p>Creates a new custom event of the specified type.  If a custom event\nby that name already exists, it will not be re-created.  In either\ncase the custom event is returned.</p>", "comment": "undefined@method publish\n", "returns": {"types": [{"type": "CustomEvent"}], "description": "<p>the custom event</p>"}, "src": "can/lib/yui-3.7.3.js", "line": 7985})